def @main(%onnx::Gemm_0: Tensor[(1, 5), float32] /* ty=Tensor[(1, 5), float32] span=/0/Gemm.onnx::Gemm_0:0:0 */) -> Tensor[(1, 3), float32] {
  %0 = nn.dense(%onnx::Gemm_0, meta[relay.Constant][0] /* ty=Tensor[(3, 5), float32] span=/0/Gemm.0.weight:0:0 */, units=3) /* ty=Tensor[(1, 3), float32] span=/0/Gemm:0:0 */;
  %1 = add(%0, meta[relay.Constant][1] /* ty=Tensor[(3), float32] span=/0/Gemm.0.bias:0:0 */) /* ty=Tensor[(1, 3), float32] span=/0/Gemm:0:0 */;
  sigmoid(%1) /* ty=Tensor[(1, 3), float32] span=/1/Sigmoid:0:0 */
}
